Учет_ФК/src/Catalogs/ПартииПродукции/ПартииПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПартииПродукции</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияВладелец</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВесБруттоПартииВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВесНеттоПартииВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВесНеттоПартииСухой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВлажностьПриВыпускеПартии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоAu</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоAg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Учет_ФК/src/InformationRegisters/ДанныеЛабораторныхИсследований/ДанныеЛабораторныхИсследований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЛабораторныхИсследований</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СодержаниеAu</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиСодержанияAu</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СодержаниеAg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиСодержанияAg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПримесиSобщ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиПримесиSобщ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПримесиCорг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиПримесиCорг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПримесиAs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиПрмесиAs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПримесиFe</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиПрмесиFe</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЛабораторнаяПроба</name>
    <type>
      <types>CatalogRef.ЛабораторныеПробы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/InformationRegisters/ДанныеПаспортовКачества/ДанныеПаспортовКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПаспортовКачества</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПаспортКачества</name>
    <type>
      <types>DocumentRef.ПаспортКачестваНаПартиюПродукции</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <dimensions>
    <name>ПартияПродукции</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/Catalogs/ПартииПродукции/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если не Параметры.Ключ.Пустая() Тогда 
		ПроверитьНаличиеИсследованийПартиии(Параметры.Ключ);	
		ПроверитьНаличиеПаспортаКачества(Параметры.Ключ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеИсследованийПартиии(СсылкаНаПартию)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеЛабораторныхИсследований.Регистратор.МоментВремени КАК РегистраторМоментВремени,
		|	ДанныеЛабораторныхИсследований.ЛабораторнаяПроба КАК ЛабораторнаяПроба,
		|	ДанныеЛабораторныхИсследований.Партия КАК Партия,
		|	ДанныеЛабораторныхИсследований.СодержаниеAu КАК СодержаниеAu,
		|	ДанныеЛабораторныхИсследований.ПоказательТочностиСодержанияAu КАК ПоказательТочностиСодержанияAu,
		|	ДанныеЛабораторныхИсследований.СодержаниеAg КАК СодержаниеAg,
		|	ДанныеЛабораторныхИсследований.ПоказательТочностиСодержанияAg КАК ПоказательТочностиСодержанияAg,
		|	ДанныеЛабораторныхИсследований.ПримесиSобщ КАК ПримесиSобщ,
		|	ДанныеЛабораторныхИсследований.ПоказательТочностиПримесиSобщ КАК ПоказательТочностиПримесиSобщ,
		|	ДанныеЛабораторныхИсследований.ПримесиCорг КАК ПримесиCорг,
		|	ДанныеЛабораторныхИсследований.ПоказательТочностиПримесиCорг КАК ПоказательТочностиПримесиCорг,
		|	ДанныеЛабораторныхИсследований.ПримесиAs КАК ПримесиAs,
		|	ДанныеЛабораторныхИсследований.ПоказательТочностиПрмесиAs КАК ПоказательТочностиПримесиAs,
		|	ДанныеЛабораторныхИсследований.ПримесиFe КАК ПримесиFe,
		|	ДанныеЛабораторныхИсследований.ПоказательТочностиПрмесиFe КАК ПоказательТочностиПримесиFe
		|ИЗ
		|	РегистрСведений.ДанныеЛабораторныхИсследований КАК ДанныеЛабораторныхИсследований
		|ГДЕ
		|	ДанныеЛабораторныхИсследований.Партия = &Партия
		|
		|УПОРЯДОЧИТЬ ПО
		|	РегистраторМоментВремени";
	
	Запрос.УстановитьПараметр("Партия",СсылкаНаПартию);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ИсследованияПроведены = Истина;
		
		СодержаниеAu = ВыборкаДетальныеЗаписи.СодержаниеAu;
		ПоказательТочностиСодержанияAu = ВыборкаДетальныеЗаписи.ПоказательТочностиСодержанияAu;
		СодержаниеAg = ВыборкаДетальныеЗаписи.СодержаниеAg;
		ПоказательТочностиСодержанияAg = ВыборкаДетальныеЗаписи.ПоказательТочностиСодержанияAg;
		ПримесиSобщ = ВыборкаДетальныеЗаписи.ПримесиSобщ;
		ПоказательТочностиПрмесиSобщ = ВыборкаДетальныеЗаписи.ПоказательТочностиПримесиSобщ;
		ПримесиCорг = ВыборкаДетальныеЗаписи.ПримесиCорг;
		ПоказательТочностиПримесиCорг = ВыборкаДетальныеЗаписи.ПоказательТочностиПримесиCорг;
		ПримесиAs = ВыборкаДетальныеЗаписи.ПримесиAs;
		ПоказательТочностиПрмесиAs = ВыборкаДетальныеЗаписи.ПоказательТочностиПримесиAs;
		ПримесиFe  = ВыборкаДетальныеЗаписи.ПримесиFe;
		ПоказательТочностиПрмесиFe = ВыборкаДетальныеЗаписи.ПоказательТочностиПримесиFe;
		
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ПроверитьНаличиеПаспортаКачества(СсылкаНаПартию)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПаспортовКачества.ПартияПродукции КАК ПартияПродукции,
		|	ДанныеПаспортовКачества.ПаспортКачества КАК ПаспортКачества
		|ИЗ
		|	РегистрСведений.ДанныеПаспортовКачества КАК ДанныеПаспортовКачества
		|ГДЕ
		|	ДанныеПаспортовКачества.ПартияПродукции = &ПартияПродукции";
	
	Запрос.УстановитьПараметр("ПартияПродукции", СсылкаНаПартию);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ПаспортКачестваГотов = Истина;
		ПаспортКачества = ВыборкаДетальныеЗаписи.ПаспортКачества;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	Элементы.ГруппаСодержаниеДрагметалла.Видимость = ИсследованияПроведены;
	Элементы.ГруппаСодержаниеПримесей.Видимость = ИсследованияПроведены;
	Элементы.ГруппаПаспортКачества.Видимость = ПаспортКачестваГотов;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
// СтандартныеПодсистемы.ВерсионированиеОбъектов
ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
КонецПроцедуры
